testdata/IN_2023_02/Roundtrip/produkt/zusatz/avmg/20140514_mindestbeitrag_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    
  <soapenv:Body>
        
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
              
      <tarif:Request>
                    
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                    
        <tarif:Tarifierung>
                          
          <gevo:Vermittler>
                              
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                            
          </gevo:Vermittler>
                          
          <tarif:Partner xsi:type="partner:CT_Person">
                                
            <partner:PartnerID>1</partner:PartnerID>
                                
            <partner:Geburtsdatum>1982-11-01</partner:Geburtsdatum>
              
                    
            <partner:Geschlecht>1</partner:Geschlecht>
                            
          </tarif:Partner>
                          
          <tarif:Verkaufsprodukt>
                                
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                                      
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                            
                <vbl:Tarifgruppe>Honorar</vbl:Tarifgruppe>
                                        
              </basis:Erweiterung>
                                      
              <pm:GewuenschteZahlungsweise>1</pm:GewuenschteZahlungsweise>
                                      
              <pm:Versicherungsdauer>
                                          
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
                        
              </pm:Versicherungsdauer>
                                      
              <pm:Kennung>AIR</pm:Kennung>
                                      
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ZulagenRente">
                                            
                <pm:Versicherungsdauer>
                                                  
                  <allg:AnzahlJahre>25</allg:AnzahlJahre>
                                              
                </pm:Versicherungsdauer>
                                            
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                            
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                                            
                <pm-leben:VersichertePerson>
                                                  
                  <partner:PartnerID>1</partner:PartnerID>
                                              
                </pm-leben:VersichertePerson>
                                            
                <pm-leben:ZulagenDaten>
                                                
                  <basis:Erweiterung xsi:type="vbl:CT_ZulagenDatenErweiterung">
                                                    
                    <vbl:Familienstand>OhneNichtSelbstBerechtigtenPartner</vbl:Familienstand>
                                                  
                  </basis:Erweiterung>
                                                
                  <pm-leben:Foerderungsberechtigung>selbst</pm-leben:Foerderungsberechtigung>
                                                
                  <pm-leben:EinkommenVorjahr>1</pm-leben:EinkommenVorjahr>
                                                
                  <pm-leben:Eigenbeitragsart>min</pm-leben:Eigenbeitragsart>
                                              
                </pm-leben:ZulagenDaten>
                                        
              </pm:Elementarprodukt>
                                      
              <pm-leben:VorgabeBerechnung>
                                          
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                          
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">ZulagenRente</pm-leben:Kontext>
                                        
              </pm-leben:VorgabeBerechnung>
                                  
            </pm:Produkt>
                            
          </tarif:Verkaufsprodukt>
                      
        </tarif:Tarifierung>
                
      </tarif:Request>
          
    </tarif:getQuote>
      
  </soapenv:Body>
  
</soapenv:Envelope>
